Repository: ahmed23423/Weather-App-SE-Project
Catalog: lib/app/localization/app_*.arb
Languages: ar

# onBoardingOneHead
source: Your Appearance Shows Your Quality
ar: جودة مظهرك تتجلى هنا

# onBoardingOneSub
source: Change The Quality Of Your Appearance With MNMLMANDI Now!
ar: قم بتغيير جودة مظهرك مع MNMLMANDI الآن!

# onBoardingTwoHead
source: Anytime, AnyWhere
ar: في أي وقت وفي أي مكان

# onBoardingTwoSub
source: Shop With Ease And Convenience _ Browse Thousands Tf Products
ar: تسوق بسهولة وراحة - تصفح آلاف المنتجات

# onBoardingThreeHead
source: Ready To Find A Product?
ar: هل أنت مستعد للعثور على منتج؟

# onBoardingThreeSub
source: Join The MNMLMANDI Community Today And Enjoy Early Access To New Products, And Much More!
ar: انضم إلى مجتمع MNMLMANDI اليوم واستمتع بالوصول المبكر إلى المنتجات الجديدة وأكثر!

source: Skip
ar: تخطي

# getStart
source: Get Started
ar: البدء

source: Login
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب

source: Email
ar: البريد الالكتروني

source: Password
ar: كلمة السر

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: OR
ar: أو

source: Login With Google
ar: تسجيل الدخول باستخدام جوجل

source: New To Logistics?
ar: لا يوجد لديك حساب

source: Register
ar: إنشاء حساب

source: Full Name
ar: الاسم الكامل

source: Mobile
ar: رقم الجوال

# bySigningUpPartOne
source: By signing up, you're agree to our
ar: بالتسجيل، أنت توافق على

# bySigningUpPartTwo
source: Terms & Conditions
ar: الشروط والأحكام

# bySigningUpPartThree
source: and
ar: و

# bySigningUpPartFour
source: Privacy policy
ar: سياسة الخصوصية

# continueB
source: Continue
ar: استمر

# otp_message
source: An 6 digit code has been sent to
ar: تم إرسال رمز مكون من 6 أرقام إلى

source: Enter OTP
ar: أدخل رمز التحقق

source: Check
ar: تحقق

source: Enter Password
ar: أدخل كلمة المرور

source: Confirm password
ar: تأكيد كلمة المرور

source: Submit
ar: إنشاء

# passwordNotSame
source: The password not the same
ar: كملة المرور غير متشابةّ

source: Search Product
ar: ابحث عن منتجك

# oopsEmail
source: Oops! please enter your email
ar: أووبس! رجاء ادخل بيريدك الالكتروني

# oopsPassword
source: Oops! please enter your password
ar: أووبس! رجاء ادخل كلمة المرور

# oopsName
source: Oops! please enter your full name
ar: أووبس! رجاء ادخل اسمك كاملا

# oopsNumber
source: Oops! please enter your mobile number
ar: أووبس! رجاء ادخل رقم هاتفك

# oopsConfirmPassword
source: Oops! please confirm you password
ar: أووبس! يرجى التأكد من صحة كلمة المرور الخاصه بك

# homeTap
source: HOME
ar: الصفحة الرئيسية

# exploreTap
source: EXPLORE
ar: الفئات

# cartTap
source: CART
ar: العربة

# profileTap
source: PROFILE
ar: الملف الشخصى

source: Product
ar: منتج

source: Try Again
ar: حاول مجددا

# wrong_password
source: The provided password is incorrect. Please try again.
ar: كلمة المرور المدخلة غير صحيحة. يرجى المحاولة مرة أخرى.

# invalid_email
source: The email address entered is invalid. Please check the email format and try again.
ar: البريد الإلكتروني المدخل غير صالح. يرجى التحقق من صيغة البريد الإلكتروني والمحاولة مرة أخرى.

# user_disabled
source: Your account has been disabled. Please contact support for assistance.
ar: تم تعطيل حسابك. يرجى التواصل مع الدعم للحصول على المساعدة.

# user_not_found
source: The user account associated with this email does not exist. Please sign up for a new account.
ar: لا يوجد حساب مستخدم مرتبط بهذا البريد الإلكتروني. يرجى التسجيل للحصول على حساب جديد.

# email_already_in_use
source: The email address provided is already associated with an existing account. Please use a different email or try signing in.
ar: عنوان البريد الإلكتروني المقدم مرتبط بالفعل بحساب موجود. يرجى استخدام بريد إلكتروني آخر أو المحاولة لتسجيل الدخول.

# operation_not_allowed
source: This operation is not allowed. Please contact support for further assistance.
ar: هذه العملية غير مسموح بها. يرجى التواصل مع الدعم للحصول على المساعدة.

# weak_password
source: The password you entered is weak. Please choose a stronger password with a combination of letters, numbers, and symbols.
ar: كلمة المرور التي أدخلتها ضعيفة. يرجى اختيار كلمة مرور أقوى تحتوي على مزيج من الحروف والأرقام والرموز.

# account_exists_with_different_credential
source: An account already exists with a different sign_in method for the same email address. Please try a different sign_in method or contact support for assistance.
ar: تم إنشاء حساب بالفعل باستخدام طريقة تسجيل دخول مختلفة لنفس البريد الإلكتروني. يرجى تجربة طريقة تسجيل دخول مختلفة أو التواصل مع الدعم للحصول على المساعدة.

# invalid_credential
source: The provided credential is invalid. Please check your credentials and try again.
ar: البيانات المقدمة غير صحيحة. يرجى التحقق من بياناتك والمحاولة مرة أخرى.

# invalid_verification_code
source: The verification code entered is invalid. Please double_check the code and try again.
ar: رمز التحقق المدخل غير صالح. يرجى التحقق من الرمز والمحاولة مرة أخرى.

# invalid_verification_id
source: The verification ID is invalid. Please request a new verification code.
ar: معرف التحقق غير صالح. يرجى طلب رمز تحقق جديد.

# user_mismatch
source: There is a mismatch between the current user and the requested operation. Please sign in again.
ar: هناك عدم تطابق بين المستخدم الحالي والعملية المطلوبة. يرجى تسجيل الدخول مرة أخرى.

# expired_action_code
source: The action code has expired. Please request a new one and try again.
ar: انتهت صلاحية رمز العملية. يرجى طلب رمز جديد والمحاولة مرة أخرى.

# invalid_phone_number
source: The phone number provided is invalid. Please check the number and try again.
ar: رقم الهاتف المدخل غير صالح. يرجى التحقق من الرقم والمحاولة مرة أخرى.

# claims_too_large
source: The size of the claims being passed is too large. Please reduce the size and try again.
ar: حجم المطالبات الممررة كبير جدًا. يرجى تقليص الحجم والمحاولة مرة أخرى.

# email_already_exists
source: The email address provided already exists. Please use a different email or try signing in.
ar: عنوان البريد الإلكتروني المُقدم موجود بالفعل. يُرجى استخدام عنوان بريد إلكتروني مختلف أو محاولة تسجيل الدخول.

# id_token_expired
source: The ID token has expired. Please sign in again.
ar: انتهت صلاحية رمز الهوية. يُرجى تسجيل الدخول مرة أخرى.

# id_token_revoked
source: The ID token has been revoked. Please sign in again.
ar: تم إلغاء رمز الهوية. يُرجى تسجيل الدخول مرة أخرى.

# insufficient_permission
source: You do not have sufficient permissions to perform this action. Please contact support for assistance.
ar: ليس لديك الصلاحيات الكافية لأداء هذا الإجراء. يُرجى التواصل مع الدعم للحصول على المساعدة.

# internal_error
source: An internal error has occurred. Please try again later or contact support for assistance.
ar: حدث خطأ داخلي. يُرجى المحاولة مرة أخرى لاحقًا أو التواصل مع الدعم للحصول على المساعدة.

# invalid_argument
source: The provided argument is invalid. Please check your input and try again.
ar: الوسيط المقدم غير صالح. يُرجى التحقق من الإدخال الخاص بك والمحاولة مرة أخرى.

# invalid_claims
source: The claims provided are invalid. Please review the claims and try again.
ar: المطالبات المقدمة غير صالحة. يُرجى مراجعة المطالبات والمحاولة مرة أخرى.

# invalid_continue_uri
source: The provided continue URI is invalid. Please check the URI and try again.
ar: عنوان URI المستمر المقدم غير صالح. يُرجى التحقق من العنوان والمحاولة مرة أخرى.

# invalid_creation_time
source: The creation time provided is invalid. Please provide a valid creation time.
ar: وقت الإنشاء المقدم غير صالح. يُرجى توفير وقت إنشاء صالح.

# invalid_disabled_field
source: The disabled field value is invalid. Please provide a valid value for the disabled field.
ar: قيمة حقل التعطيل غير صالحة. يُرجى توفير قيمة صالحة لحقل التعطيل.

# invalid_display_name
source: The provided display name is invalid. Please enter a valid display name.
ar: اسم العرض المقدم غير صالح. يُرجى إدخال اسم عرض صالح.

# invalid_dynamic_link_domain
source: The provided dynamic link domain is invalid. Please enter a valid dynamic link domain.
ar: نطاق الرابط الديناميكي المقدم غير صالح. يُرجى إدخال نطاق رابط ديناميكي صالح.

# invalid_email_verified
source: The email verification status is invalid. Please provide a valid email verification status.
ar: حالة التحقق من البريد الإلكتروني غير صالحة. يُرجى توفير حالة تحقق بريد إلكتروني صالحة.

# invalid_hash_algorithm
source: The provided hash algorithm is invalid. Please use a valid hash algorithm.
ar: خوارزمية التجزئة المقدمة غير صالحة. يُرجى استخدام خوارزمية تجزئة صالحة.

# invalid_hash_block_size
source: The provided hash block size is invalid. Please use a valid hash block size.
ar: حجم كتلة التجزئة المقدم غير صالح. يُرجى استخدام حجم كتلة تجزئة صالح.

# invalid_hash_derived_key_length
source: The provided hash derived key length is invalid. Please use a valid key length.
ar: طول المفتاح المشتق من التجزئة المقدم غير صالح. يُرجى استخدام طول مفتاح صالح.

# invalid_hash_key
source: The provided hash key is invalid. Please use a valid hash key.
ar: المفتاح المقدم غير صالح. يُرجى استخدام مفتاح تجزئة صالح.

# invalid_hash_memory_cost
source: The provided hash memory cost is invalid. Please use a valid memory cost.
ar: تكلفة ذاكرة التجزئة المقدمة غير صالحة. يُرجى استخدام تكلفة ذاكرة صالحة.

# invalid_hash_rounds
source: The provided hash rounds value is invalid. Please use a valid rounds value.
ar: قيمة جولات التجزئة المقدمة غير صالحة. يُرجى استخدام قيمة جولات صالحة.

# invalid_hash_salt_separator
source: The provided hash salt separator is invalid. Please use a valid salt separator.
ar: فاصل الملح المقدم غير صالح. يُرجى استخدام فاصل ملح صالح.

# invalid_id_token
source: The ID token provided is invalid. Please provide a valid ID token.
ar: رمز الهوية المقدم غير صالح. يُرجى توفير رمز هوية صالح.

# invalid_last_sign_in_time
source: The provided last sign_in time is invalid. Please use a valid last sign_in time.
ar: وقت تسجيل الدخول الأخير المقدم غير صالح. يُرجى استخدام وقت تسجيل دخول صالح.

# invalid_page_token
source: The page token provided is invalid. Please use a valid page token.
ar: الرمز المميز للصفحة المقدم غير صالح. يُرجى استخدام رمز مميز للصفحة صالح.

# invalid_password
source: The provided password is invalid. Please enter a valid password.
ar: كلمة المرور المقدمة غير صالحة. يُرجى إدخال كلمة مرور صالحة.

# default_error
source: An error occurred while processing your request. Please try again later.
ar: حدث خطأ أثناء معالجة طلبك. يُرجى المحاولة مرة أخرى لاحقًا.

# success
source: The operation was successful.
ar: تمت العملية بنجاح.

# no_content
source: The request was successful, but there is no data to return.
ar: تم استلام الطلب بنجاح، ولكن لا توجد بيانات لإرجاعها.

# bad_request
source: The request was malformed or invalid. Please check the request and try again.
ar: الطلب غير صحيح أو غير صالح. يُرجى التحقق من الطلب والمحاولة مرة أخرى.

# unauthorized
source: The request requires authentication, but the user is not authenticated. Please log in and try again.
ar: يتطلب الطلب المصادقة، ولكن المستخدم غير مصادق. يُرجى تسجيل الدخول والمحاولة مرة أخرى.

# forbidden
source: The user does not have permission to access the requested resource. Please contact support for assistance.
ar: المستخدم ليس لديه إذن للوصول إلى المورد المطلوب. يُرجى التواصل مع الدعم للحصول على المساعدة.

# internal_server_error
source: There was an error processing your request. Please try again later or contact support for assistance.
ar: حدث خطأ في معالجة طلبك. يُرجى المحاولة مرة أخرى لاحقًا أو التواصل مع الدعم للحصول على المساعدة.

# connect_timeout
source: The request timed out while trying to establish a connection. Please check your internet connection and try again.
ar: انتهت مهلة الاتصال أثناء محاولة إنشاء اتصال. يُرجى التحقق من اتصال الإنترنت الخاص بك والمحاولة مرة أخرى.

# cancel
source: The request was cancelled. Please try again.
ar: تم إلغاء الطلب. يُرجى المحاولة مرة أخرى.

# receive_timeout
source: The server did not respond within the expected time. Please try again later.
ar: لم يتم الرد من الخادم في الوقت المتوقع. يُرجى المحاولة مرة أخرى لاحقًا.

# send_timeout
source: The request timed out while sending data to the server. Please check your internet connection and try again.
ar: انتهت مهلة الطلب أثناء إرسال البيانات إلى الخادم. يُرجى التحقق من اتصال الإنترنت الخاص بك والمحاولة مرة أخرى.

# cache_error
source: There was an error retrieving data from the cache. Please try again later.
ar: حدث خطأ في استرداد البيانات من ذاكرة التخزين المؤقت. يُرجى المحاولة مرة أخرى لاحقًا.

# no_internet_connection
source: There is no internet connection. Please check your connection and try again.
ar: لا يوجد اتصال بالإنترنت. يُرجى التحقق من الاتصال الخاص بك والمحاولة مرة أخرى.

# defaultError
source: There was an unspecified error. Please try again later or contact support for assistance.
ar: حدث خطأ غير محدد. يُرجى المحاولة مرة أخرى لاحقًا أو التواصل مع الدعم للحصول على المساعدة.

# connection_error
source: There was an error establishing a connection. Please check your internet connection and try again.
ar: حدث خطأ في إنشاء الاتصال. يُرجى التحقق من اتصال الإنترنت الخاص بك والمحاولة مرة أخرى.

# bad_certificate
source: The server's SSL/TLS certificate is invalid. Please contact support for assistance.
ar: شهادة SSL/TLS للخادم غير صالحة. يُرجى التواصل مع الدعم للحصول على المساعدة.

# bad_response
source: The server returned an unexpected or invalid response. Please try again later.
ar: قام الخادم بإرجاع استجابة غير متوقعة أو غير صالحة. يُرجى المحاولة مرة أخرى لاحقًا.

# invalid_hash_parallelization
source: The provided hash parallelization is invalid. Please use a valid parallelization value.
ar: قيمة توازي التجزئة المقدمة غير صالحة. يُرجى استخدام قيمة توازي صالحة.

# quota_exceeded
source: You have exceeded your usage quota. Please contact support for more information.
ar: لقد تخطيت حصة الاستخدام الخاصة بك، يرجى الاتصال بالدعم للحصول على مزيد من المعلومات.
